---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SeekItemId
source: html/67c6168e-d4dc-537c-d4f4-cda6132b7977.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SeekItemId Property

"Seek Item ID"

## Syntax (C#)
```csharp
public static ForgeTypeId SeekItemId { get; }
```